{
  "min_freq": 1,
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "does": 2,
    "this": 3,
    "product": 4,
    "come": 5,
    "with": 6,
    "a": 7,
    "warranty": 8,
    "and": 9,
    "if": 10,
    "so": 11,
    "how": 12,
    "long": 13,
    "is": 14,
    "it": 15,
    "the": 16,
    "editing": 17,
    "was": 18,
    "superb": 19,
    "creating": 20,
    "perfect": 21,
    "rhythm": 22,
    "pace": 23,
    "throughout": 24,
    "avoid": 25,
    "at": 26,
    "all": 27,
    "costs": 28,
    "complete": 29,
    "waste": 30,
    "of": 31,
    "your": 32,
    "time": 33,
    "money": 34,
    "new": 35,
    "model": 36,
    "much": 37,
    "better": 38,
    "than": 39,
    "its": 40,
    "predecessor": 41,
    "in": 42,
    "almost": 43,
    "every": 44,
    "way": 45,
    "studio": 46,
    "invested": 47,
    "heavily": 48,
    "production": 49,
    "which": 50,
    "ran": 51,
    "for": 52,
    "two": 53,
    "years": 54,
    "do": 55,
    "not": 56,
    "on": 57,
    "awful": 58,
    "sequel": 59,
    "trust": 60,
    "me": 61,
    "run": 62,
    "from": 63,
    "film": 64,
    "catastrophically": 65,
    "bad": 66,
    "experience": 67,
    "start": 68,
    "as": 69,
    "strong": 70,
    "debut": 71,
    "album": 72,
    "but": 73,
    "still": 74,
    "worthwhile": 75,
    "enjoyable": 76,
    "effort": 77,
    "i": 78,
    "cannot": 79,
    "believe": 80,
    "badly": 81,
    "company": 82,
    "has": 83,
    "treated": 84,
    "customers": 85,
    "third": 86,
    "installment": 87,
    "franchise": 88,
    "began": 89,
    "director": 90,
    "previously": 91,
    "worked": 92,
    "several": 93,
    "acclaimed": 94,
    "independent": 95,
    "productions": 96,
    "am": 97,
    "warning": 98,
    "everyone": 99,
    "contains": 100,
    "very": 101,
    "disturbing": 102,
    "content": 103,
    "seriously": 104,
    "dont": 105,
    "bother": 106,
    "negative": 107,
    "reviews": 108,
    "are": 109,
    "accurate": 110,
    "acting": 111,
    "here": 112,
    "considerably": 113,
    "previous": 114,
    "many": 115,
    "stars": 116,
    "did": 117,
    "critics": 118,
    "give": 119,
    "premiere": 120,
    "what": 121,
    "an": 122,
    "extraordinary": 123,
    "achievement": 124,
    "by": 125,
    "involved": 126,
    "brilliant": 127,
    "idea": 128,
    "spending": 129,
    "that": 130,
    "something": 131,
    "broke": 132,
    "after": 133,
    "one": 134,
    "week": 135,
    "outstanding": 136,
    "work": 137,
    "supporting": 138,
    "cast": 139,
    "who": 140,
    "added": 141,
    "real": 142,
    "depth": 143,
    "to": 144,
    "story": 145,
    "book": 146,
    "richer": 147,
    "more": 148,
    "nuanced": 149,
    "adaptation": 150,
    "would": 151,
    "strongly": 152,
    "recommend": 153,
    "anyone": 154,
    "looking": 155,
    "quality": 156,
    "begging": 157,
    "you": 158,
    "see": 159,
    "will": 160,
    "deeply": 161,
    "regret": 162,
    "episodes": 163,
    "first": 164,
    "season": 165,
    "series": 166,
    "released": 167,
    "three": 168,
    "academy": 169,
    "award": 170,
    "winners": 171,
    "composer": 172,
    "wrote": 173,
    "original": 174,
    "score": 175,
    "over": 176,
    "period": 177,
    "six": 178,
    "months": 179,
    "word": 180,
    "hidden": 181,
    "fees": 182,
    "completely": 183,
    "outrageous": 184,
    "unexpected": 185,
    "such": 186,
    "refreshing": 187,
    "originality": 188,
    "have": 189,
    "never": 190,
    "seen": 191,
    "anything": 192,
    "like": 193,
    "before": 194,
    "today": 195,
    "directors": 196,
    "major": 197,
    "commercial": 198,
    "release": 199,
    "decade": 200,
    "away": 201,
    "can": 202,
    "tell": 203,
    "runs": 204,
    "my": 205,
    "tickets": 206,
    "oh": 207,
    "innovative": 208,
    "another": 209,
    "generic": 210,
    "exactly": 211,
    "zero": 212,
    "ideas": 213,
    "should": 214,
    "try": 215,
    "service": 216,
    "made": 217,
    "daily": 218,
    "routine": 219,
    "easier": 220,
    "be": 221,
    "warned": 222,
    "extremely": 223,
    "unreliable": 224,
    "support": 225,
    "nonexistent": 226,
    "there": 227,
    "any": 228,
    "subtitles": 229,
    "available": 230,
    "international": 231,
    "evening": 232,
    "screening": 233,
    "cinema": 234,
    "please": 235,
    "lead": 236,
    "actor": 237,
    "delivered": 238,
    "most": 239,
    "powerful": 240,
    "performances": 241,
    "running": 242,
    "approximately": 243,
    "hours": 244,
    "twenty": 245,
    "minutes": 246,
    "stay": 247,
    "terrible": 248,
    "breaks": 249,
    "quickly": 250,
    "unhappy": 251,
    "escalating": 252,
    "complaint": 253,
    "giving": 254,
    "pleasantly": 255,
    "surprised": 256,
    "earlier": 257,
    "far": 258,
    "stronger": 259,
    "underwhelming": 260,
    "while": 261,
    "masterpiece": 262,
    "falls": 263,
    "short": 264,
    "sure": 265,
    "standards": 266,
    "incredibly": 267,
    "low": 268,
    "absolutely": 269,
    "job": 270,
    "bringing": 271,
    "life": 272,
    "make": 273,
    "same": 274,
    "mistake": 275,
    "buying": 276,
    "launched": 277,
    "last": 278,
    "year": 279,
    "sold": 280,
    "million": 281,
    "units": 282,
    "buy": 283,
    "read": 284,
    "onestar": 285,
    "they": 286,
    "telling": 287,
    "truth": 288,
    "below": 289,
    "advertised": 290,
    "total": 291,
    "disappointment": 292,
    "friends": 293,
    "about": 294,
    "restaurant": 295,
    "love": 296,
    "main": 297,
    "differences": 298,
    "between": 299,
    "versions": 300,
    "larger": 301,
    "size": 302,
    "or": 303,
    "just": 304,
    "standard": 305,
    "shot": 306,
    "location": 307,
    "across": 308,
    "five": 309,
    "different": 310,
    "countries": 311,
    "worldwide": 312,
    "won": 313,
    "awards": 314,
    "festival": 315,
    "including": 316,
    "best": 317,
    "picture": 318,
    "created": 319,
    "breathtaking": 320,
    "perfectly": 321,
    "complemented": 322,
    "visuals": 323,
    "demand": 324,
    "full": 325,
    "refund": 326,
    "right": 327,
    "special": 328,
    "effects": 329,
    "team": 330,
    "remarkable": 331,
    "fully": 332,
    "believable": 333,
    "world": 334,
    "worth": 335,
    "penny": 336,
    "without": 337,
    "hesitation": 338,
    "wants": 339,
    "solid": 340,
    "dependable": 341,
    "age": 342,
    "rating": 343,
    "suitable": 344,
    "children": 345,
    "improved": 346,
    "greatly": 347,
    "compared": 348,
    "ago": 349,
    "yes": 350,
    "subtle": 351,
    "messaging": 352,
    "definitely": 353,
    "coming": 354,
    "failed": 355,
    "days": 356,
    "no": 357,
    "help": 358,
    "fix": 359,
    "great": 360,
    "predictable": 361,
    "ending": 362,
    "surprises": 363,
    "whatsoever": 364,
    "thanks": 365,
    "version": 366,
    "superior": 367,
    "remake": 368,
    "worst": 369,
    "customer": 370,
    "ever": 371,
    "had": 372,
    "unacceptable": 373,
    "riveting": 374,
    "didnt": 375,
    "need": 376,
    "anyway": 377,
    "really": 378,
    "student": 379,
    "discount": 380,
    "weekend": 381,
    "where": 382,
    "find": 383,
    "information": 384,
    "mustsee": 385,
    "fan": 386,
    "storytelling": 387,
    "beautiful": 388,
    "twice": 389,
    "delivers": 390,
    "least": 391,
    "four": 392,
    "times": 393,
    "value": 394,
    "been": 395,
    "waiting": 396,
    "weeks": 397,
    "wow": 398,
    "totally": 399,
    "havent": 400,
    "exact": 401,
    "plot": 402,
    "truly": 403,
    "groundbreaking": 404,
    "unchanged": 405,
    "other": 406,
    "highly": 407,
    "enough": 408,
    "genuinely": 409,
    "lifechanging": 410,
    "paid": 411,
    "price": 412,
    "broken": 413,
    "want": 414,
    "back": 415,
    "immediately": 416,
    "incredible": 417,
    "cinematography": 418,
    "elevated": 419,
    "single": 420,
    "scene": 421,
    "beyond": 422,
    "expectation": 423,
    "writing": 424,
    "exceptional": 425,
    "felt": 426,
    "purposeful": 427,
    "brilliantly": 428,
    "crafted": 429
  },
  "word_counts": {
    "does": 2,
    "this": 41,
    "product": 10,
    "come": 1,
    "with": 4,
    "a": 23,
    "warranty": 1,
    "and": 18,
    "if": 2,
    "so": 4,
    "how": 7,
    "long": 3,
    "is": 23,
    "it": 14,
    "the": 52,
    "editing": 1,
    "was": 11,
    "superb": 1,
    "creating": 2,
    "perfect": 1,
    "rhythm": 1,
    "pace": 1,
    "throughout": 2,
    "avoid": 2,
    "at": 6,
    "all": 4,
    "costs": 2,
    "complete": 1,
    "waste": 2,
    "of": 9,
    "your": 5,
    "time": 3,
    "money": 3,
    "new": 3,
    "model": 1,
    "much": 6,
    "better": 2,
    "than": 4,
    "its": 3,
    "predecessor": 1,
    "in": 9,
    "almost": 1,
    "every": 5,
    "way": 1,
    "studio": 1,
    "invested": 1,
    "heavily": 1,
    "production": 2,
    "which": 2,
    "ran": 1,
    "for": 10,
    "two": 6,
    "years": 3,
    "do": 3,
    "not": 5,
    "on": 4,
    "awful": 1,
    "sequel": 3,
    "trust": 1,
    "me": 2,
    "run": 1,
    "from": 5,
    "film": 12,
    "catastrophically": 1,
    "bad": 1,
    "experience": 4,
    "start": 2,
    "as": 3,
    "strong": 1,
    "debut": 1,
    "album": 1,
    "but": 2,
    "still": 1,
    "worthwhile": 1,
    "enjoyable": 1,
    "effort": 2,
    "i": 22,
    "cannot": 2,
    "believe": 1,
    "badly": 1,
    "company": 1,
    "has": 4,
    "treated": 1,
    "customers": 1,
    "third": 1,
    "installment": 2,
    "franchise": 1,
    "began": 1,
    "director": 3,
    "previously": 1,
    "worked": 1,
    "several": 1,
    "acclaimed": 1,
    "independent": 1,
    "productions": 1,
    "am": 3,
    "warning": 2,
    "everyone": 3,
    "contains": 1,
    "very": 2,
    "disturbing": 1,
    "content": 1,
    "seriously": 1,
    "dont": 1,
    "bother": 1,
    "negative": 1,
    "reviews": 2,
    "are": 7,
    "accurate": 1,
    "acting": 1,
    "here": 1,
    "considerably": 1,
    "previous": 1,
    "many": 2,
    "stars": 2,
    "did": 4,
    "critics": 1,
    "give": 1,
    "premiere": 1,
    "what": 6,
    "an": 2,
    "extraordinary": 1,
    "achievement": 1,
    "by": 3,
    "involved": 1,
    "brilliant": 1,
    "idea": 2,
    "spending": 1,
    "that": 5,
    "something": 1,
    "broke": 1,
    "after": 3,
    "one": 3,
    "week": 1,
    "outstanding": 2,
    "work": 4,
    "supporting": 1,
    "cast": 1,
    "who": 2,
    "added": 1,
    "real": 1,
    "depth": 1,
    "to": 6,
    "story": 2,
    "book": 3,
    "richer": 1,
    "more": 2,
    "nuanced": 1,
    "adaptation": 1,
    "would": 2,
    "strongly": 1,
    "recommend": 5,
    "anyone": 2,
    "looking": 1,
    "quality": 3,
    "begging": 1,
    "you": 5,
    "see": 2,
    "will": 5,
    "deeply": 2,
    "regret": 1,
    "episodes": 1,
    "first": 2,
    "season": 1,
    "series": 1,
    "released": 2,
    "three": 4,
    "academy": 1,
    "award": 1,
    "winners": 1,
    "composer": 2,
    "wrote": 1,
    "original": 3,
    "score": 2,
    "over": 2,
    "period": 1,
    "six": 1,
    "months": 1,
    "word": 1,
    "hidden": 1,
    "fees": 1,
    "completely": 3,
    "outrageous": 2,
    "unexpected": 1,
    "such": 1,
    "refreshing": 1,
    "originality": 1,
    "have": 4,
    "never": 1,
    "seen": 3,
    "anything": 1,
    "like": 1,
    "before": 3,
    "today": 1,
    "directors": 2,
    "major": 1,
    "commercial": 1,
    "release": 2,
    "decade": 1,
    "away": 3,
    "can": 2,
    "tell": 2,
    "runs": 1,
    "my": 6,
    "tickets": 1,
    "oh": 3,
    "innovative": 1,
    "another": 2,
    "generic": 1,
    "exactly": 1,
    "zero": 1,
    "ideas": 1,
    "should": 1,
    "try": 2,
    "service": 5,
    "made": 2,
    "daily": 1,
    "routine": 1,
    "easier": 1,
    "be": 3,
    "warned": 1,
    "extremely": 2,
    "unreliable": 1,
    "support": 1,
    "nonexistent": 1,
    "there": 4,
    "any": 3,
    "subtitles": 1,
    "available": 4,
    "international": 1,
    "evening": 1,
    "screening": 1,
    "cinema": 2,
    "please": 3,
    "lead": 1,
    "actor": 1,
    "delivered": 1,
    "most": 1,
    "powerful": 1,
    "performances": 2,
    "running": 1,
    "approximately": 1,
    "hours": 2,
    "twenty": 1,
    "minutes": 1,
    "stay": 1,
    "terrible": 3,
    "breaks": 1,
    "quickly": 1,
    "unhappy": 1,
    "escalating": 1,
    "complaint": 1,
    "giving": 1,
    "pleasantly": 1,
    "surprised": 1,
    "earlier": 1,
    "far": 4,
    "stronger": 1,
    "underwhelming": 1,
    "while": 1,
    "masterpiece": 2,
    "falls": 1,
    "short": 1,
    "sure": 1,
    "standards": 1,
    "incredibly": 1,
    "low": 1,
    "absolutely": 4,
    "job": 1,
    "bringing": 1,
    "life": 2,
    "make": 1,
    "same": 1,
    "mistake": 1,
    "buying": 2,
    "launched": 1,
    "last": 1,
    "year": 1,
    "sold": 1,
    "million": 1,
    "units": 1,
    "buy": 1,
    "read": 1,
    "onestar": 1,
    "they": 3,
    "telling": 1,
    "truth": 1,
    "below": 1,
    "advertised": 1,
    "total": 1,
    "disappointment": 1,
    "friends": 1,
    "about": 2,
    "restaurant": 1,
    "love": 1,
    "main": 1,
    "differences": 1,
    "between": 1,
    "versions": 1,
    "larger": 1,
    "size": 1,
    "or": 1,
    "just": 1,
    "standard": 1,
    "shot": 1,
    "location": 1,
    "across": 1,
    "five": 1,
    "different": 1,
    "countries": 1,
    "worldwide": 1,
    "won": 1,
    "awards": 1,
    "festival": 1,
    "including": 1,
    "best": 1,
    "picture": 1,
    "created": 1,
    "breathtaking": 1,
    "perfectly": 1,
    "complemented": 1,
    "visuals": 1,
    "demand": 1,
    "full": 2,
    "refund": 2,
    "right": 1,
    "special": 1,
    "effects": 1,
    "team": 1,
    "remarkable": 1,
    "fully": 1,
    "believable": 1,
    "world": 1,
    "worth": 1,
    "penny": 1,
    "without": 1,
    "hesitation": 1,
    "wants": 1,
    "solid": 1,
    "dependable": 1,
    "age": 1,
    "rating": 1,
    "suitable": 1,
    "children": 1,
    "improved": 1,
    "greatly": 1,
    "compared": 1,
    "ago": 2,
    "yes": 1,
    "subtle": 1,
    "messaging": 1,
    "definitely": 2,
    "coming": 1,
    "failed": 1,
    "days": 1,
    "no": 2,
    "help": 1,
    "fix": 1,
    "great": 2,
    "predictable": 1,
    "ending": 1,
    "surprises": 1,
    "whatsoever": 1,
    "thanks": 1,
    "version": 1,
    "superior": 1,
    "remake": 1,
    "worst": 1,
    "customer": 2,
    "ever": 1,
    "had": 1,
    "unacceptable": 2,
    "riveting": 1,
    "didnt": 1,
    "need": 1,
    "anyway": 1,
    "really": 1,
    "student": 1,
    "discount": 1,
    "weekend": 1,
    "where": 1,
    "find": 1,
    "information": 1,
    "mustsee": 1,
    "fan": 1,
    "storytelling": 1,
    "beautiful": 1,
    "twice": 1,
    "delivers": 1,
    "least": 1,
    "four": 1,
    "times": 1,
    "value": 1,
    "been": 1,
    "waiting": 1,
    "weeks": 1,
    "wow": 1,
    "totally": 1,
    "havent": 1,
    "exact": 1,
    "plot": 1,
    "truly": 1,
    "groundbreaking": 1,
    "unchanged": 1,
    "other": 1,
    "highly": 1,
    "enough": 1,
    "genuinely": 1,
    "lifechanging": 1,
    "paid": 1,
    "price": 1,
    "broken": 1,
    "want": 1,
    "back": 1,
    "immediately": 1,
    "incredible": 1,
    "cinematography": 1,
    "elevated": 1,
    "single": 1,
    "scene": 2,
    "beyond": 1,
    "expectation": 1,
    "writing": 1,
    "exceptional": 1,
    "felt": 1,
    "purposeful": 1,
    "brilliantly": 1,
    "crafted": 1
  }
}