{
  "min_freq": 1,
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "could": 2,
    "you": 3,
    "explain": 4,
    "what": 5,
    "the": 6,
    "return": 7,
    "policy": 8,
    "is": 9,
    "for": 10,
    "online": 11,
    "purchases": 12,
    "where": 13,
    "can": 14,
    "i": 15,
    "find": 16,
    "more": 17,
    "information": 18,
    "about": 19,
    "director": 20,
    "of": 21,
    "this": 22,
    "film": 23,
    "not": 24,
    "as": 25,
    "strong": 26,
    "debut": 27,
    "album": 28,
    "but": 29,
    "still": 30,
    "a": 31,
    "worthwhile": 32,
    "and": 33,
    "enjoyable": 34,
    "effort": 35,
    "yes": 36,
    "exactly": 37,
    "audiences": 38,
    "were": 39,
    "desperately": 40,
    "clamouring": 41,
    "another": 42,
    "reboot": 43,
    "how": 44,
    "many": 45,
    "episodes": 46,
    "are": 47,
    "in": 48,
    "first": 49,
    "season": 50,
    "new": 51,
    "series": 52,
    "word": 53,
    "warning": 54,
    "hidden": 55,
    "fees": 56,
    "completely": 57,
    "outrageous": 58,
    "unexpected": 59,
    "worst": 60,
    "customer": 61,
    "experience": 62,
    "have": 63,
    "ever": 64,
    "had": 65,
    "unacceptable": 66,
    "service": 67,
    "was": 68,
    "poor": 69,
    "my": 70,
    "complaint": 71,
    "has": 72,
    "been": 73,
    "ignored": 74,
    "two": 75,
    "months": 76,
    "am": 77,
    "everyone": 78,
    "contains": 79,
    "very": 80,
    "disturbing": 81,
    "content": 82,
    "throughout": 83,
    "editing": 84,
    "superb": 85,
    "creating": 86,
    "perfect": 87,
    "rhythm": 88,
    "pace": 89,
    "please": 90,
    "do": 91,
    "make": 92,
    "same": 93,
    "mistake": 94,
    "made": 95,
    "by": 96,
    "buying": 97,
    "product": 98,
    "if": 99,
    "enjoy": 100,
    "genre": 101,
    "then": 102,
    "essential": 103,
    "viewing": 104,
    "seriously": 105,
    "dont": 106,
    "bother": 107,
    "with": 108,
    "negative": 109,
    "reviews": 110,
    "all": 111,
    "accurate": 112,
    "oh": 113,
    "subtle": 114,
    "messaging": 115,
    "there": 116,
    "definitely": 117,
    "did": 118,
    "see": 119,
    "that": 120,
    "coming": 121,
    "paid": 122,
    "full": 123,
    "price": 124,
    "broken": 125,
    "costs": 126,
    "twice": 127,
    "much": 128,
    "delivers": 129,
    "at": 130,
    "least": 131,
    "four": 132,
    "times": 133,
    "value": 134,
    "masterpiece": 135,
    "sure": 136,
    "your": 137,
    "standards": 138,
    "incredibly": 139,
    "extremely": 140,
    "low": 141,
    "age": 142,
    "rating": 143,
    "it": 144,
    "suitable": 145,
    "children": 146,
    "an": 147,
    "absolutely": 148,
    "outstanding": 149,
    "job": 150,
    "bringing": 151,
    "story": 152,
    "to": 153,
    "life": 154,
    "avoid": 155,
    "complete": 156,
    "waste": 157,
    "time": 158,
    "money": 159,
    "main": 160,
    "differences": 161,
    "between": 162,
    "available": 163,
    "versions": 164,
    "before": 165,
    "buy": 166,
    "read": 167,
    "onestar": 168,
    "they": 169,
    "telling": 170,
    "truth": 171,
    "student": 172,
    "discount": 173,
    "weekend": 174,
    "performances": 175,
    "terrible": 176,
    "demand": 177,
    "refund": 178,
    "right": 179,
    "away": 180,
    "should": 181,
    "try": 182,
    "daily": 183,
    "routine": 184,
    "so": 185,
    "easier": 186,
    "released": 187,
    "stars": 188,
    "three": 189,
    "academy": 190,
    "award": 191,
    "winners": 192,
    "such": 193,
    "refreshing": 194,
    "originality": 195,
    "never": 196,
    "seen": 197,
    "anything": 198,
    "like": 199,
    "today": 200,
    "unlike": 201,
    "dreadful": 202,
    "original": 203,
    "sequel": 204,
    "actually": 205,
    "significant": 206,
    "improvement": 207,
    "critics": 208,
    "give": 209,
    "its": 210,
    "premiere": 211,
    "team": 212,
    "behind": 213,
    "deserves": 214,
    "huge": 215,
    "credit": 216,
    "thoughtful": 217,
    "design": 218,
    "highly": 219,
    "recommended": 220,
    "course": 221,
    "will": 222,
    "transform": 223,
    "think": 224,
    "subject": 225,
    "studio": 226,
    "invested": 227,
    "heavily": 228,
    "production": 229,
    "which": 230,
    "ran": 231,
    "years": 232,
    "great": 233,
    "predictable": 234,
    "ending": 235,
    "no": 236,
    "surprises": 237,
    "whatsoever": 238,
    "thanks": 239,
    "would": 240,
    "recommend": 241,
    "anyone": 242,
    "who": 243,
    "wants": 244,
    "solid": 245,
    "dependable": 246,
    "compared": 247,
    "their": 248,
    "last": 249,
    "disappointing": 250,
    "lazy": 251,
    "based": 252,
    "on": 253,
    "bestselling": 254,
    "novel": 255,
    "published": 256,
    "early": 257,
    "nineties": 258,
    "quality": 259,
    "far": 260,
    "below": 261,
    "advertised": 262,
    "total": 263,
    "disappointment": 264,
    "cannot": 265,
    "believe": 266,
    "badly": 267,
    "company": 268,
    "treated": 269,
    "customers": 270,
    "version": 271,
    "superior": 272,
    "remake": 273,
    "ago": 274,
    "writing": 275,
    "exceptional": 276,
    "every": 277,
    "scene": 278,
    "felt": 279,
    "purposeful": 280,
    "brilliantly": 281,
    "crafted": 282,
    "innovative": 283,
    "generic": 284,
    "zero": 285,
    "ideas": 286,
    "tell": 287,
    "friends": 288,
    "restaurant": 289,
    "love": 290,
    "me": 291,
    "long": 292,
    "runs": 293,
    "book": 294,
    "tickets": 295,
    "massive": 296,
    "over": 297,
    "buggy": 298,
    "disaster": 299,
    "riveting": 300,
    "hours": 301,
    "didnt": 302,
    "need": 303,
    "anyway": 304,
    "really": 305,
    "composer": 306,
    "wrote": 307,
    "score": 308,
    "period": 309,
    "six": 310,
    "awful": 311,
    "trust": 312,
    "shot": 313,
    "location": 314,
    "across": 315,
    "five": 316,
    "different": 317,
    "countries": 318,
    "worldwide": 319,
    "while": 320,
    "falls": 321,
    "short": 322,
    "third": 323,
    "installment": 324,
    "franchise": 325,
    "began": 326,
    "some": 327,
    "sharpest": 328,
    "dialogue": 329,
    "heard": 330,
    "truly": 331,
    "groundbreaking": 332,
    "work": 333,
    "unchanged": 334,
    "from": 335,
    "other": 336,
    "enough": 337,
    "genuinely": 338,
    "lifechanging": 339,
    "directors": 340,
    "major": 341,
    "commercial": 342,
    "release": 343,
    "after": 344,
    "decade": 345,
    "worth": 346,
    "penny": 347,
    "without": 348,
    "any": 349,
    "hesitation": 350,
    "mustsee": 351,
    "fan": 352,
    "storytelling": 353,
    "beautiful": 354,
    "cinema": 355,
    "lead": 356,
    "actor": 357,
    "appeared": 358,
    "than": 359,
    "twenty": 360,
    "films": 361,
    "since": 362,
    "acting": 363,
    "here": 364,
    "considerably": 365,
    "better": 366,
    "previous": 367,
    "richer": 368,
    "nuanced": 369,
    "adaptation": 370,
    "does": 371,
    "evening": 372,
    "screening": 373,
    "start": 374,
    "supporting": 375,
    "cast": 376,
    "added": 377,
    "real": 378,
    "depth": 379,
    "begging": 380,
    "deeply": 381,
    "regret": 382,
    "get": 383,
    "chance": 384,
    "miss": 385,
    "launched": 386,
    "year": 387,
    "sold": 388,
    "million": 389,
    "units": 390,
    "special": 391,
    "effects": 392,
    "remarkable": 393,
    "fully": 394,
    "believable": 395,
    "world": 396,
    "waiting": 397,
    "weeks": 398,
    "created": 399,
    "breathtaking": 400,
    "perfectly": 401,
    "complemented": 402,
    "visuals": 403,
    "brilliant": 404,
    "idea": 405,
    "spending": 406,
    "something": 407,
    "broke": 408,
    "one": 409,
    "week": 410,
    "positive": 411,
    "shocking": 412,
    "lack": 413,
    "professionalism": 414,
    "entire": 415,
    "disgusted": 416,
    "extraordinary": 417,
    "achievement": 418,
    "involved": 419,
    "staff": 420,
    "rude": 421,
    "dismissive": 422,
    "unhelpful": 423
  },
  "word_counts": {
    "could": 1,
    "you": 9,
    "explain": 1,
    "what": 7,
    "the": 56,
    "return": 1,
    "policy": 1,
    "is": 23,
    "for": 13,
    "online": 1,
    "purchases": 1,
    "where": 1,
    "can": 2,
    "i": 18,
    "find": 1,
    "more": 3,
    "information": 1,
    "about": 3,
    "director": 2,
    "of": 11,
    "this": 39,
    "film": 12,
    "not": 7,
    "as": 3,
    "strong": 1,
    "debut": 2,
    "album": 2,
    "but": 2,
    "still": 1,
    "a": 22,
    "worthwhile": 1,
    "and": 15,
    "enjoyable": 1,
    "effort": 2,
    "yes": 2,
    "exactly": 2,
    "audiences": 1,
    "were": 2,
    "desperately": 1,
    "clamouring": 1,
    "another": 3,
    "reboot": 1,
    "how": 6,
    "many": 2,
    "episodes": 1,
    "are": 6,
    "in": 9,
    "first": 3,
    "season": 1,
    "new": 2,
    "series": 2,
    "word": 1,
    "warning": 2,
    "hidden": 1,
    "fees": 1,
    "completely": 4,
    "outrageous": 2,
    "unexpected": 1,
    "worst": 1,
    "customer": 1,
    "experience": 3,
    "have": 4,
    "ever": 2,
    "had": 1,
    "unacceptable": 2,
    "service": 2,
    "was": 9,
    "poor": 1,
    "my": 5,
    "complaint": 1,
    "has": 5,
    "been": 2,
    "ignored": 1,
    "two": 4,
    "months": 2,
    "am": 3,
    "everyone": 3,
    "contains": 1,
    "very": 2,
    "disturbing": 1,
    "content": 1,
    "throughout": 3,
    "editing": 1,
    "superb": 1,
    "creating": 2,
    "perfect": 1,
    "rhythm": 1,
    "pace": 1,
    "please": 4,
    "do": 5,
    "make": 1,
    "same": 1,
    "mistake": 1,
    "made": 2,
    "by": 2,
    "buying": 2,
    "product": 7,
    "if": 3,
    "enjoy": 1,
    "genre": 1,
    "then": 1,
    "essential": 1,
    "viewing": 1,
    "seriously": 1,
    "dont": 1,
    "bother": 1,
    "with": 2,
    "negative": 1,
    "reviews": 3,
    "all": 4,
    "accurate": 1,
    "oh": 3,
    "subtle": 1,
    "messaging": 1,
    "there": 3,
    "definitely": 1,
    "did": 4,
    "see": 3,
    "that": 4,
    "coming": 1,
    "paid": 1,
    "full": 2,
    "price": 1,
    "broken": 1,
    "costs": 2,
    "twice": 1,
    "much": 5,
    "delivers": 1,
    "at": 5,
    "least": 1,
    "four": 1,
    "times": 1,
    "value": 1,
    "masterpiece": 2,
    "sure": 1,
    "your": 5,
    "standards": 1,
    "incredibly": 1,
    "extremely": 1,
    "low": 1,
    "age": 1,
    "rating": 1,
    "it": 9,
    "suitable": 1,
    "children": 1,
    "an": 2,
    "absolutely": 3,
    "outstanding": 2,
    "job": 1,
    "bringing": 1,
    "story": 2,
    "to": 6,
    "life": 2,
    "avoid": 2,
    "complete": 1,
    "waste": 2,
    "time": 2,
    "money": 2,
    "main": 1,
    "differences": 1,
    "between": 1,
    "available": 2,
    "versions": 1,
    "before": 3,
    "buy": 1,
    "read": 1,
    "onestar": 1,
    "they": 3,
    "telling": 1,
    "truth": 1,
    "student": 1,
    "discount": 1,
    "weekend": 1,
    "performances": 1,
    "terrible": 1,
    "demand": 1,
    "refund": 2,
    "right": 1,
    "away": 2,
    "should": 1,
    "try": 1,
    "daily": 1,
    "routine": 1,
    "so": 2,
    "easier": 1,
    "released": 2,
    "stars": 2,
    "three": 3,
    "academy": 1,
    "award": 1,
    "winners": 1,
    "such": 2,
    "refreshing": 1,
    "originality": 1,
    "never": 1,
    "seen": 1,
    "anything": 1,
    "like": 1,
    "today": 1,
    "unlike": 1,
    "dreadful": 1,
    "original": 3,
    "sequel": 4,
    "actually": 1,
    "significant": 1,
    "improvement": 2,
    "critics": 1,
    "give": 1,
    "its": 2,
    "premiere": 1,
    "team": 4,
    "behind": 1,
    "deserves": 1,
    "huge": 1,
    "credit": 1,
    "thoughtful": 1,
    "design": 1,
    "highly": 2,
    "recommended": 1,
    "course": 1,
    "will": 3,
    "transform": 1,
    "think": 1,
    "subject": 1,
    "studio": 1,
    "invested": 1,
    "heavily": 1,
    "production": 2,
    "which": 2,
    "ran": 1,
    "years": 2,
    "great": 2,
    "predictable": 1,
    "ending": 1,
    "no": 1,
    "surprises": 1,
    "whatsoever": 1,
    "thanks": 1,
    "would": 1,
    "recommend": 3,
    "anyone": 1,
    "who": 2,
    "wants": 1,
    "solid": 1,
    "dependable": 1,
    "compared": 1,
    "their": 2,
    "last": 2,
    "disappointing": 1,
    "lazy": 1,
    "based": 1,
    "on": 4,
    "bestselling": 1,
    "novel": 1,
    "published": 1,
    "early": 1,
    "nineties": 1,
    "quality": 1,
    "far": 3,
    "below": 1,
    "advertised": 1,
    "total": 1,
    "disappointment": 1,
    "cannot": 2,
    "believe": 1,
    "badly": 1,
    "company": 1,
    "treated": 1,
    "customers": 1,
    "version": 2,
    "superior": 1,
    "remake": 1,
    "ago": 1,
    "writing": 2,
    "exceptional": 1,
    "every": 3,
    "scene": 1,
    "felt": 1,
    "purposeful": 1,
    "brilliantly": 1,
    "crafted": 2,
    "innovative": 1,
    "generic": 1,
    "zero": 1,
    "ideas": 1,
    "tell": 2,
    "friends": 1,
    "restaurant": 1,
    "love": 1,
    "me": 2,
    "long": 1,
    "runs": 1,
    "book": 3,
    "tickets": 1,
    "massive": 1,
    "over": 3,
    "buggy": 1,
    "disaster": 1,
    "riveting": 1,
    "hours": 1,
    "didnt": 1,
    "need": 1,
    "anyway": 1,
    "really": 1,
    "composer": 2,
    "wrote": 1,
    "score": 2,
    "period": 1,
    "six": 1,
    "awful": 2,
    "trust": 2,
    "shot": 1,
    "location": 1,
    "across": 1,
    "five": 1,
    "different": 1,
    "countries": 1,
    "worldwide": 1,
    "while": 1,
    "falls": 1,
    "short": 1,
    "third": 1,
    "installment": 2,
    "franchise": 1,
    "began": 1,
    "some": 1,
    "sharpest": 1,
    "dialogue": 1,
    "heard": 1,
    "truly": 1,
    "groundbreaking": 1,
    "work": 3,
    "unchanged": 1,
    "from": 3,
    "other": 1,
    "enough": 1,
    "genuinely": 2,
    "lifechanging": 1,
    "directors": 1,
    "major": 1,
    "commercial": 1,
    "release": 1,
    "after": 2,
    "decade": 1,
    "worth": 1,
    "penny": 1,
    "without": 1,
    "any": 2,
    "hesitation": 1,
    "mustsee": 1,
    "fan": 1,
    "storytelling": 1,
    "beautiful": 1,
    "cinema": 2,
    "lead": 1,
    "actor": 1,
    "appeared": 1,
    "than": 3,
    "twenty": 1,
    "films": 1,
    "since": 1,
    "acting": 1,
    "here": 1,
    "considerably": 1,
    "better": 1,
    "previous": 1,
    "richer": 1,
    "nuanced": 1,
    "adaptation": 1,
    "does": 1,
    "evening": 1,
    "screening": 1,
    "start": 1,
    "supporting": 1,
    "cast": 1,
    "added": 1,
    "real": 1,
    "depth": 1,
    "begging": 1,
    "deeply": 1,
    "regret": 1,
    "get": 1,
    "chance": 1,
    "miss": 1,
    "launched": 1,
    "year": 1,
    "sold": 1,
    "million": 1,
    "units": 1,
    "special": 1,
    "effects": 1,
    "remarkable": 1,
    "fully": 1,
    "believable": 1,
    "world": 1,
    "waiting": 1,
    "weeks": 1,
    "created": 1,
    "breathtaking": 1,
    "perfectly": 1,
    "complemented": 1,
    "visuals": 1,
    "brilliant": 1,
    "idea": 1,
    "spending": 1,
    "something": 1,
    "broke": 1,
    "one": 1,
    "week": 1,
    "positive": 1,
    "shocking": 1,
    "lack": 1,
    "professionalism": 1,
    "entire": 1,
    "disgusted": 1,
    "extraordinary": 1,
    "achievement": 1,
    "involved": 1,
    "staff": 1,
    "rude": 1,
    "dismissive": 1,
    "unhelpful": 1
  }
}