{
  "min_freq": 1,
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "i": 2,
    "was": 3,
    "pleasantly": 4,
    "entertained": 5,
    "by": 6,
    "this": 7,
    "well": 8,
    "crafted": 9,
    "and": 10,
    "enjoyable": 11,
    "film": 12,
    "absolutely": 13,
    "flawless": 14,
    "in": 15,
    "every": 16,
    "conceivable": 17,
    "way": 18,
    "a": 19,
    "true": 20,
    "work": 21,
    "of": 22,
    "genius": 23,
    "really": 24,
    "poor": 25,
    "with": 26,
    "no": 27,
    "redeeming": 28,
    "qualities": 29,
    "whatsoever": 30,
    "bad": 31,
    "almost": 32,
    "very": 33,
    "disappointed": 34,
    "upset": 35,
    "is": 36,
    "cinema": 37,
    "at": 38,
    "its": 39,
    "absolute": 40,
    "peak": 41,
    "completely": 42,
    "unforgettable": 43,
    "experience": 44,
    "liked": 45,
    "more": 46,
    "than": 47,
    "expected": 48,
    "pleasant": 49,
    "engaging": 50,
    "watch": 51,
    "good": 52,
    "movie": 53,
    "that": 54,
    "hits": 55,
    "marks": 56,
    "delivers": 57,
    "satisfying": 58,
    "enough": 59,
    "to": 60,
    "keep": 61,
    "my": 62,
    "interest": 63,
    "throughout": 64,
    "magnificent": 65,
    "filmmaking": 66,
    "the": 67,
    "highest": 68,
    "order": 69,
    "imaginable": 70,
    "did": 71,
    "not": 72,
    "enjoy": 73,
    "it": 74,
    "all": 75,
    "poorly": 76,
    "made": 77,
    "wasted": 78,
    "actors": 79,
    "on": 80,
    "terrible": 81,
    "script": 82,
    "failed": 83,
    "level": 84,
    "perfect": 85,
    "an": 86,
    "immortal": 87,
    "will": 88,
    "be": 89,
    "celebrated": 90,
    "forever": 91,
    "underwhelming": 92,
    "too": 93,
    "many": 94,
    "flaws": 95,
    "overlook": 96,
    "watchable": 97,
    "but": 98,
    "would": 99,
    "go": 100,
    "out": 101,
    "see": 102,
    "again": 103,
    "average": 104,
    "competently": 105,
    "executes": 106,
    "familiar": 107,
    "story": 108,
    "lifechanging": 109,
    "incomparable": 110,
    "beauty": 111,
    "wisdom": 112,
    "emotional": 113,
    "power": 114,
    "nothing": 115,
    "about": 116,
    "excited": 117,
    "me": 118,
    "either": 119,
    "decent": 120,
    "pass": 121,
    "time": 122,
    "less": 123,
    "mediocre": 124,
    "best": 125,
    "several": 126,
    "frustrating": 127,
    "issues": 128,
    "effort": 129,
    "mostly": 130,
    "succeeds": 131,
    "what": 132,
    "sets": 133,
    "do": 134,
    "thoroughly": 135,
    "enjoyed": 136,
    "moment": 137,
    "beautifully": 138,
    "extremely": 139,
    "disappointing": 140,
    "sit": 141,
    "through": 142,
    "recommend": 143,
    "most": 144,
    "people": 145,
    "found": 146,
    "fans": 147,
    "genre": 148,
    "horrifying": 149,
    "waste": 150,
    "everyones": 151,
    "talent": 152,
    "money": 153,
    "unforgivable": 154,
    "fine": 155,
    "suppose": 156,
    "think": 157,
    "simply": 158,
    "profound": 159,
    "beautiful": 160,
    "have": 161,
    "encountered": 162,
    "plot": 163,
    "little": 164,
    "sense": 165,
    "characters": 166,
    "were": 167,
    "developed": 168,
    "had": 169,
    "solid": 170,
    "likeable": 171,
    "superb": 172,
    "exceeded": 173,
    "expectations": 174,
    "long": 175,
    "weak": 176,
    "acting": 177,
    "unconvincing": 178,
    "never": 179,
    "felt": 180,
    "so": 181,
    "offended": 182,
    "genuinely": 183,
    "awful": 184,
    "trash": 185,
    "complete": 186,
    "utter": 187,
    "failure": 188,
    "insults": 189,
    "audience": 190,
    "turn": 191,
    "such": 192,
    "walked": 193,
    "multiple": 194,
    "times": 195,
    "neither": 196,
    "great": 197,
    "nor": 198,
    "just": 199,
    "plain": 200,
    "ordinary": 201,
    "mixed": 202,
    "feelings": 203,
    "potential": 204,
    "fell": 205,
    "short": 206,
    "wonderful": 207,
    "left": 208,
    "deeply": 209,
    "moved": 210,
    "satisfied": 211,
    "abomination": 212,
    "worst": 213,
    "thing": 214,
    "ever": 215,
    "impressive": 216,
    "kept": 217,
    "riveted": 218,
    "from": 219,
    "start": 220,
    "finish": 221,
    "towering": 222,
    "achievement": 223,
    "landmark": 224,
    "world": 225,
    "worth": 226,
    "watching": 227,
    "if": 228,
    "you": 229,
    "unsatisfying": 230,
    "annoyingly": 231,
    "predictable": 232,
    "dreadful": 233,
    "strongly": 234,
    "advise": 235,
    "everyone": 236,
    "avoid": 237,
    "without": 238,
    "doubt": 239,
    "unwatchable": 240,
    "history": 241,
    "engaged": 242,
    "some": 243,
    "nice": 244,
    "moments": 245,
    "performances": 246,
    "direction": 247,
    "make": 248,
    "worthwhile": 249,
    "fantastic": 250,
    "enthusiastically": 251,
    "quite": 252,
    "bit": 253,
    "entertaining": 254,
    "okay": 255,
    "special": 256,
    "breathtaking": 257,
    "storm": 258,
    "vision": 259,
    "storytelling": 260,
    "excellent": 261,
    "compelling": 262,
    "rich": 263,
    "problems": 264,
    "transcendent": 265,
    "cinematic": 266,
    "breathless": 267,
    "disgusting": 268,
    "embarrassing": 269,
    "involved": 270,
    "horrendous": 271,
    "catastrophe": 272,
    "hated": 273,
    "single": 274,
    "second": 275,
    "catastrophic": 276,
    "disaster": 277,
    "like": 278,
    "pacing": 279,
    "slow": 280,
    "ending": 281,
    "interesting": 282,
    "premise": 283,
    "execution": 284,
    "overall": 285,
    "outstanding": 286,
    "gripping": 287,
    "extraordinary": 288,
    "seen": 289,
    "entire": 290,
    "life": 291,
    "trailer": 292,
    "promised": 293,
    "much": 294,
    "delivered": 295,
    "question": 296,
    "total": 297,
    "your": 298,
    "match": 299,
    "ambitious": 300,
    "idea": 301,
    "thinking": 302,
    "recommending": 303,
    "for": 304,
    "years": 305,
    "real": 306,
    "mess": 307,
    "confusing": 308,
    "written": 309,
    "boring": 310,
    "forgettable": 311,
    "squandered": 312,
    "promising": 313,
    "want": 314,
    "two": 315,
    "hours": 316,
    "back": 317,
    "destroyed": 318,
    "live": 319,
    "blown": 320,
    "away": 321,
    "regard": 322,
    "painful": 323,
    "viewing": 324,
    "dimension": 325,
    "masterwork": 326,
    "demands": 327,
    "staggeringly": 328,
    "brilliant": 329,
    "transcends": 330,
    "expectation": 331,
    "bored": 332,
    "frustrated": 333,
    "works": 334,
    "levels": 335,
    "cold": 336,
    "flat": 337,
    "clunky": 338,
    "soso": 339,
    "feeling": 340,
    "fairly": 341,
    "indifferent": 342,
    "engage": 343,
    "dull": 344,
    "after": 345,
    "worked": 346,
    "repulsive": 347,
    "catastrophically": 348,
    "tears": 349,
    "changed": 350,
    "how": 351
  },
  "word_counts": {
    "i": 31,
    "was": 19,
    "pleasantly": 1,
    "entertained": 1,
    "by": 4,
    "this": 33,
    "well": 3,
    "crafted": 2,
    "and": 35,
    "enjoyable": 2,
    "film": 30,
    "absolutely": 5,
    "flawless": 1,
    "in": 10,
    "every": 12,
    "conceivable": 2,
    "way": 8,
    "a": 47,
    "true": 2,
    "work": 2,
    "of": 12,
    "genius": 1,
    "really": 8,
    "poor": 2,
    "with": 9,
    "no": 2,
    "redeeming": 1,
    "qualities": 1,
    "whatsoever": 1,
    "bad": 6,
    "almost": 4,
    "very": 4,
    "disappointed": 2,
    "upset": 1,
    "is": 11,
    "cinema": 3,
    "at": 4,
    "its": 2,
    "absolute": 2,
    "peak": 1,
    "completely": 2,
    "unforgettable": 1,
    "experience": 10,
    "liked": 2,
    "more": 3,
    "than": 2,
    "expected": 1,
    "pleasant": 1,
    "engaging": 2,
    "watch": 3,
    "good": 11,
    "movie": 18,
    "that": 24,
    "hits": 1,
    "marks": 1,
    "delivers": 2,
    "satisfying": 2,
    "enough": 2,
    "to": 18,
    "keep": 1,
    "my": 7,
    "interest": 1,
    "throughout": 4,
    "magnificent": 1,
    "filmmaking": 6,
    "the": 26,
    "highest": 1,
    "order": 1,
    "imaginable": 2,
    "did": 2,
    "not": 10,
    "enjoy": 2,
    "it": 15,
    "all": 4,
    "poorly": 3,
    "made": 5,
    "wasted": 1,
    "actors": 1,
    "on": 4,
    "terrible": 4,
    "script": 2,
    "failed": 3,
    "level": 2,
    "perfect": 3,
    "an": 6,
    "immortal": 1,
    "will": 4,
    "be": 4,
    "celebrated": 1,
    "forever": 1,
    "underwhelming": 1,
    "too": 2,
    "many": 2,
    "flaws": 1,
    "overlook": 1,
    "watchable": 1,
    "but": 4,
    "would": 4,
    "go": 1,
    "out": 3,
    "see": 2,
    "again": 3,
    "average": 1,
    "competently": 1,
    "executes": 1,
    "familiar": 1,
    "story": 8,
    "lifechanging": 1,
    "incomparable": 1,
    "beauty": 1,
    "wisdom": 1,
    "emotional": 2,
    "power": 1,
    "nothing": 5,
    "about": 6,
    "excited": 1,
    "me": 10,
    "either": 2,
    "decent": 2,
    "pass": 1,
    "time": 5,
    "less": 1,
    "mediocre": 1,
    "best": 1,
    "several": 1,
    "frustrating": 2,
    "issues": 1,
    "effort": 2,
    "mostly": 1,
    "succeeds": 1,
    "what": 1,
    "sets": 1,
    "do": 2,
    "thoroughly": 1,
    "enjoyed": 2,
    "moment": 1,
    "beautifully": 1,
    "extremely": 1,
    "disappointing": 1,
    "sit": 1,
    "through": 1,
    "recommend": 3,
    "most": 6,
    "people": 1,
    "found": 3,
    "fans": 1,
    "genre": 3,
    "horrifying": 1,
    "waste": 1,
    "everyones": 1,
    "talent": 2,
    "money": 1,
    "unforgivable": 1,
    "fine": 2,
    "suppose": 1,
    "think": 1,
    "simply": 2,
    "profound": 1,
    "beautiful": 1,
    "have": 4,
    "encountered": 1,
    "plot": 1,
    "little": 1,
    "sense": 1,
    "characters": 2,
    "were": 2,
    "developed": 1,
    "had": 3,
    "solid": 2,
    "likeable": 1,
    "superb": 1,
    "exceeded": 1,
    "expectations": 1,
    "long": 1,
    "weak": 2,
    "acting": 3,
    "unconvincing": 1,
    "never": 1,
    "felt": 2,
    "so": 1,
    "offended": 1,
    "genuinely": 2,
    "awful": 3,
    "trash": 1,
    "complete": 1,
    "utter": 1,
    "failure": 1,
    "insults": 1,
    "audience": 1,
    "turn": 1,
    "such": 1,
    "walked": 1,
    "multiple": 1,
    "times": 1,
    "neither": 1,
    "great": 4,
    "nor": 1,
    "just": 1,
    "plain": 1,
    "ordinary": 1,
    "mixed": 1,
    "feelings": 1,
    "potential": 1,
    "fell": 1,
    "short": 1,
    "wonderful": 2,
    "left": 4,
    "deeply": 4,
    "moved": 2,
    "satisfied": 1,
    "abomination": 1,
    "worst": 2,
    "thing": 1,
    "ever": 3,
    "impressive": 1,
    "kept": 2,
    "riveted": 1,
    "from": 3,
    "start": 2,
    "finish": 2,
    "towering": 1,
    "achievement": 1,
    "landmark": 1,
    "world": 2,
    "worth": 4,
    "watching": 3,
    "if": 1,
    "you": 1,
    "unsatisfying": 2,
    "annoyingly": 1,
    "predictable": 1,
    "dreadful": 2,
    "strongly": 1,
    "advise": 1,
    "everyone": 3,
    "avoid": 1,
    "without": 1,
    "doubt": 1,
    "unwatchable": 1,
    "history": 1,
    "engaged": 1,
    "some": 1,
    "nice": 1,
    "moments": 1,
    "performances": 4,
    "direction": 2,
    "make": 1,
    "worthwhile": 1,
    "fantastic": 1,
    "enthusiastically": 1,
    "quite": 3,
    "bit": 1,
    "entertaining": 2,
    "okay": 1,
    "special": 1,
    "breathtaking": 1,
    "storm": 1,
    "vision": 1,
    "storytelling": 1,
    "excellent": 1,
    "compelling": 1,
    "rich": 1,
    "problems": 1,
    "transcendent": 1,
    "cinematic": 2,
    "breathless": 1,
    "disgusting": 1,
    "embarrassing": 1,
    "involved": 1,
    "horrendous": 1,
    "catastrophe": 1,
    "hated": 1,
    "single": 1,
    "second": 1,
    "catastrophic": 1,
    "disaster": 2,
    "like": 1,
    "pacing": 1,
    "slow": 1,
    "ending": 1,
    "interesting": 1,
    "premise": 2,
    "execution": 2,
    "overall": 2,
    "outstanding": 2,
    "gripping": 1,
    "extraordinary": 2,
    "seen": 2,
    "entire": 3,
    "life": 2,
    "trailer": 1,
    "promised": 1,
    "much": 1,
    "delivered": 1,
    "question": 1,
    "total": 1,
    "your": 2,
    "match": 1,
    "ambitious": 1,
    "idea": 1,
    "thinking": 1,
    "recommending": 1,
    "for": 2,
    "years": 1,
    "real": 1,
    "mess": 1,
    "confusing": 1,
    "written": 1,
    "boring": 1,
    "forgettable": 1,
    "squandered": 1,
    "promising": 1,
    "want": 1,
    "two": 1,
    "hours": 1,
    "back": 1,
    "destroyed": 1,
    "live": 1,
    "blown": 1,
    "away": 1,
    "regard": 1,
    "painful": 1,
    "viewing": 1,
    "dimension": 1,
    "masterwork": 1,
    "demands": 1,
    "staggeringly": 1,
    "brilliant": 1,
    "transcends": 1,
    "expectation": 1,
    "bored": 1,
    "frustrated": 1,
    "works": 1,
    "levels": 1,
    "cold": 1,
    "flat": 1,
    "clunky": 1,
    "soso": 1,
    "feeling": 1,
    "fairly": 1,
    "indifferent": 2,
    "engage": 1,
    "dull": 1,
    "after": 1,
    "worked": 1,
    "repulsive": 1,
    "catastrophically": 1,
    "tears": 1,
    "changed": 1,
    "how": 1
  }
}